In [37]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1      Fisika     66     perempuan   12B
1         2  Matematika     66     laki-laki   12D
2         3       Kimia     22     perempuan   12B
3         4     Ekonomi     37     laki-laki   12D
4         5     Geologi     25     laki-laki   12B

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [38]:
# code here
df[['nilai','kelas']]
df.loc[5:10,['pelajaran','nilai']]

   pelajaran  nilai
5    Biologi     82
6    Geologi      4
7    Ekonomi     97
8    Ekonomi     76
9      Kimia     88
10   Ekonomi      3

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [41]:
# code here

df.loc[(df['pelajaran'] == 'Ekonomi')| (df['pelajaran'] == 'Fisika')]

    siswa_id pelajaran  nilai jenis-kelamin kelas
0          1    Fisika     66     perempuan   12B
3          4   Ekonomi     37     laki-laki   12D
7          8   Ekonomi     97     laki-laki   12B
8          9   Ekonomi     76     laki-laki   12B
10        11   Ekonomi      3     perempuan   12A
11        12   Ekonomi      5     perempuan   12A
18        19    Fisika     65     laki-laki   12B
19        20   Ekonomi     78     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [51]:
# code here
df['nilai'] = (df['nilai'] - df['nilai'].min())/(df['nilai'].max() - df['nilai'].min())
df['nilai'].head()

0    0.656250
1    0.656250
2    0.197917
3    0.354167
4    0.229167
Name: nilai, dtype: float64